onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КА_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КА_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КА_СогласованаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	 // {{Net Коробов А.В. Заявка № 07.11.2023 начало
	ДобавитьПолеСогласованаяСкидка(); 
	// }}Net Коробов А.В. Заявка № 07.11.2023 окончание
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

// {{Net Коробов А.В. Заявка № 07.11.2023 начало
&НаКлиенте
Процедура КА_СогласоваяСкидкаПриИзменении(Элемент)
	Если Объект.Услуги.Количество() = 0 И Объект.Товары.Количество() = 0 Тогда
		Возврат;
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", 
		ЭтотОбъект),"Персчитать табличную часть?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
КонецПроцедуры
// }}Net Коробов А.В. Заявка № 07.11.2023 окончание

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// {{Net Коробов А.В. Заявка № 07.11.2023 начало
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.КА_СогласованаяСкидка;
	Если ОбщаяСкидка <= 0 Тогда
		ОбщаяСкидка = 0;
	КонецЕсли;
	КоэффициентСкидки = 1 - ОбщаяСкидка / 100;
	// }}Net Коробов А.В. Заявка № 07.11.2023 окончание
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// {{Net Коробов А.В. Заявка № 07.11.2023 начало

// Обработчик результатов ответа
//
// Параметры:
//    РезультатВопроса - Структура:
//                       Значение - результат выбора пользователя: значение
//                       системного перечисления или значение,
//                       связанное с нажатой кнопкой.
//              
//   ДополнительныеПараметры - Структура - служебный параметр, не предназначен для использования.
//           
//
&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		 ПересчитаемТабличнуюЧасть();
	 Иначе
		 Возврат;
	 КонецЕсли;
	 
 КонецПроцедуры	
    
 &НаКлиенте
 Процедура ПересчитаемТабличнуюЧасть()
	 
	 Для Каждого Строка Из Объект.Товары Цикл
		 ОбщаяСкидка = Строка.Скидка + Объект.КА_СогласованаяСкидка;
		 КоэффицентСкидки = 1 - ОбщаяСкидка / 100;
		 Если КоэффицентСкидки <= 0 Тогда
			 КоэффицентСкидки = 0;
		 КонецЕсли; 
		 Строка.Сумма = Строка.Цена * Строка.Количество * КоэффицентСкидки ;
	 КонецЦикла;
	 
	 Для Каждого Строка Из Объект.Услуги Цикл
		 ОбщаяСкидка = Строка.Скидка + Объект.КА_СогласованаяСкидка;
		 КоэффицентСкидки = 1 - ОбщаяСкидка / 100;
		 Если КоэффицентСкидки <= 0 Тогда
			 КоэффицентСкидки = 0;
		 КонецЕсли;
		 Строка.Сумма = Строка.Цена * Строка.Количество * КоэффицентСкидки; 
	 КонецЦикла;
	 
	 РассчитатьСуммуДокумента();

 КонецПроцедуры

// }}Net Коробов А.В. Заявка № 07.11.2023 окончание

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// {{Net Коробов А.В. Заявка № 07.11.2023 начало
&НаСервере
Процедура ДобавитьПолеСогласованаяСкидка()
	
	ГруппаСогласоваяСкидка = Элементы.Добавить("ГруппаСогласованаяСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);  
	ГруппаСогласоваяСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСогласоваяСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСогласоваяСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСогласоваяСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
	
	ПолеВвода = Элементы.Добавить("СогласованаяСкидка", Тип("ПолеФормы"), ГруппаСогласоваяСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КА_СогласованаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении","КА_СогласоваяСкидкаПриИзменении");
	
	КомандаПересчитатьТаблицу = Команды.Добавить("ПересчитатьТаблицу"); 
	КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
	КомандаПересчитатьТаблицу.Действие  = "ПересчитаемТабличнуюЧасть";
	
	КнопкаКомандыПересчитатьТаблицу = Элементы.Добавить("КнопкаПересчитатьТаблицу",Тип("КнопкаФормы"), ГруппаСогласоваяСкидка);
    КнопкаКомандыПересчитатьТаблицу.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаКомандыПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаКомандыПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаКомандыПересчитатьТаблицу.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры
// }}Net Коробов А.В. Заявка № 07.11.2023 окончание

#КонецОбласти
